import pandas as pd
x1 = 45; y1 = 50; z1 = 70;
x2 = 35; y2 = 30; z2 = 50;
x3 = 35; y3 = 30; z3 = 45;
x4 = 45; y4 = 45; z4 = 60;
x5 = 40; y5 = 40; z5 = 50;
x6 = 35; y6 = 35; z6 = 45;
x7 = 40; y7 = 40; z7 = 60;
x8 = 40; y8 = 40; z8 = 50;
x9 = 40; y9 = 40; z9 = 60;
code100 = 'Бесарабський'
code200 = 'Житній'
code300 = 'Володимирський'

column = pd.MultiIndex.from_product([['Ціна'],['Назва ринку','Картопля', 'Капуста', 'Цибуля']])
column = column.insert(0, ('Дата'))
column = column.insert(5, ('Код ринку'))
column = column.insert(5, ('Середня ціна'))

marketprices = pd.DataFrame([['02.11.2016', '02.11.2016', '02.11.2016', '14.11.2016', '14.11.2016', '14.11.2016', '22.11.2016', '22.11.2016', '22.11.2016'],
                               [code100, code200, code300, code100, code200, code300, code100, code200, code300],
                               [x1, x2, x3, x4, x5, x6, x7, x8, x9],
                               [y1, y2, y3, y4, y5, y6, y7, y8, y9],
                               [z1, z2, z3, z4, z5, z6, z7, z8, z9],
                               [(x1+y1+z1)/3, (x2+y2+z2)/3, (x3+y3+z3)/3, (x4+y4+z4)/3, (x5+y5+z5)/3, (x6+y6+z6)/3, (x7+y7+z7)/3, (x8+y8+z8)/3, (x9+y9+z9)/3],

                               ['100', '200', '300', '100', '200', '300', '100', '200', '300']], column).T
print(marketprices)
